Question number one, what's question number one, what is the five layer model? The five layer model. Great question. So you see iterations of this all over the place, but essentially we actually call this the automation stack. So the five layer model is a marketing term. The actual automation stack is this cloud all the way up the top. Okay, this is big data, all that cool stuff. Algorithms, machine learning. At the bottom, what we have is plc Hmi. We have supervisory control and data acquisition. We have manufacturing execution systems, and we have ERP in the old days, and actually, some people still use this. Plc and HMI are a separate layer. At the bottom, you have my equipment, our factory floor, our operations. PLc, plc, HMI, programmable logic controller, and human machine interface. SCADA is supervisory control and data acquisition. MES is manufacturing and execution system. ERP is enterprise resource planning. And this is cloud based big data analytics algorithms. What do we do at each of these layers? So what are we doing at each of the layers? At the PLC HMI layer, we're doing automation and we're doing direct control. At the SCADA layer, the supervisory control and data acquisition layer, we're collecting data. We are doing real time analysis. This would be like current evaluation of our processes, and we're doing supervisory functions. So think of the SCADA layer as the supervisor in the plant or the manager, who's responsible on the plant floor. The person responsible for the shift is interfacing with SCADA. The other thing that ScADA is used for is control rooms. So where I have distributed control somewhere out, I've got multiple facilities. I may have a control room running our SCADA system to handle things like incoming alarms, notifications, dispatching, that kind of stuff. That's your SCADA layer. PlCHMI is almost always reduced to the line, right? So when we look at the total structure here, it's normally line production line. SCADA is plants. This MES is. Think of it as business unit. ERP is the enterprise, the company itself, and cloud is everything. This would be like all of our holdings. You might share data with partners in the cloud level. So that's plc, hMi, Scada, mes, erp and cloud. The typical systems integrator. The OEM only operates here. The OEM only ever is writing the PLC code and doing the HMI. There are some Oems that try to develop mes systems, or Scada systems for the equipment that they sell. But the OEM almost exclusively deals in this layer. The Scada layer is the plants. You'll have plant resources developing ScaDA. You'll have your integrator developing ScaDA at the MES layer. It's always the integrator. I've never really seen in my career, 20 plus years, I've never seen a plant be able to develop its own mes system effectively at the ERP layer. This is it. So we're going to be talking about it and OT ERP layer is almost exclusively it and accounting. And the question mark is cloud. Who does the cloud stuff right now? There are consultants who do cloud based analytics, all cloud based integrations systems. Integrators are doing cloud based integrations. But this is the part that's in its infancy right here. There are essentially two in terms of the cutting edge component of what we do. The two growth areas here are cloud and IIot. Right? And the IIot piece is the idea that this stack is seamlessly integrated. Right now everything is manually connected. Lots of engineering goes into taking data from here to here or from here to here or from here to here. Okay.